In [1]:
# Data Preprocessing Template

# Importing the libraries
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
# Importing the dataset
url ='https://raw.githubusercontent.com/cagriemreakin/Machine-Learning/master/1-%20Data%20Preprocessing/dataset.csv'
dataset = pd.read_csv(url)
temp_dataset=dataset.copy()
X = dataset.iloc[:, :-1].values
y = dataset.iloc[:, 3].values
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

Dataset' imiz 10 satıdan oluştuğu için kolaylıkla hangi sütunlarda NaN değerler olduğunu görebiliyoruz. Fakat verisetimizin boyutu arttıkça bunu manuel olarak saptamak çok zor olacağından;

In [3]:
dataset.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

Hangi sütunda boş değer olduğunu yukarıda yazdığımız kod ile görebiliyoruz. Şimdi bu değerler üzerinde nasıl işlem yapmamız gerektiğini aşağıdaki methodlar ile inceleyelim.

### NaN değerlerin olduğu satır veya sütunları bırakma

In [4]:
dataset.dropna() # Bu method ile 4. ve 6. satırın NaN değerlerlerden dolayı drop edildiğini görelim

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [5]:
dataset.dropna(axis=1) # Eğer azis=1 yaparsakta, NaN değere sahip sütunların drop edildiğini görürüz

   Country Purchased
0   France        No
1    Spain       Yes
2  Germany        No
3    Spain        No
4  Germany       Yes
5   France       Yes
6    Spain        No
7   France       Yes
8  Germany        No
9   France       Yes

<p style= "color:#666699">Fakat NaN değerleri drop etmek akıllıca bir seçenek değildir.Yukarıdaki dataset için konuşmak gerekirse; eğer 10 satırın 9' unda NaN değer olmuş olsaydı makine öğrenme algoritmaları düşük bir doğrulukla çalışmış olacaktı. Ya da drop ettiğimiz sütunlarda değerli bilgiler olabilir.Bu yüzden genellikle imputation (töhmet) methodu kullanılır.Yani boş değerleri başka bir değerle doldurma olarak düşünebiliriz.</p>

### Imputation

In [6]:
# Dataset'imizde hangi sütunlarda NaN değer olduğuna tekrar bakalım
dataset.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [7]:
# Dealing with missing data
from sklearn.preprocessing import Imputer #Imputer Class' ının yüklenmesi

# Missing_values : Hangi değerler üzerinde işlem yapmak istediğimizi belirtme
# Strategy: Bu değerleri ne ile değiştirmek istediğimiz.
# axis= satır mı sütun mu
imputer = Imputer(missing_values = 'NaN', strategy = 'mean', axis = 0) 
# Veri setimizde NaN değere sahip sütunlar; Age 1. Salary ise 2. eleman olduğundan

imputer = imputer.fit(X[:, 1:3])
X[:, 1:3] = imputer.transform(X[:, 1:3])

In [8]:
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, 63777.77777777778],
       ['France', 35.0, 58000.0],
       ['Spain', 38.77777777777778, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

- Yukarıda Gördüğünüz üzere "AGE" sütunudaki NaN değer 38.777 ile "SALARY" sütunudaki NaN değer ise 63777.777 ile değişti.

- <p style="color:gray">Strategy "median" ve "most_frequent" seçeneklerinide alabilir. most_frequent (en sık tekrar eden) kategorik değerler için en çok kullanılan seçenektir.</p>